[Killed] Block removal mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:25:5
         IAccessTokenGenerator accessTokenGenerator,
         AspNetUserManager<ApplicationUser> aspNetUserManager,
         SignInManager<ApplicationUser> signInManager)
-    {
-        _accessTokenGenerator = accessTokenGenerator;
-        _aspNetUserManager = aspNetUserManager;
-        _signInManager = signInManager;
-    }
+    {}
 
     /// <summary>
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser; Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsAccessToken_WhenAuthenticated

[Killed] Block removal mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:55:9
         var user = await _aspNetUserManager.FindByNameAsync(request.Username);
 
         if (user == null)
-        {
-            return Unauthorized();
-        }
+        {}
 
         var signInResult = await _signInManager.CheckPasswordSignInAsync(user, request.Password, false);
killedBy: Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsUnauthorized_WhenUserNull

[Killed] Boolean mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:59:98
             return Unauthorized();
         }
 
-        var signInResult = await _signInManager.CheckPasswordSignInAsync(user, request.Password, false);
+        var signInResult = await _signInManager.CheckPasswordSignInAsync(user, request.Password, true);
 
         if (!signInResult.Succeeded)
killedBy: Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsAccessToken_WhenAuthenticated; Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsUnauthorized_WhenPasswordCheckFails

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:61:13
 
         var signInResult = await _signInManager.CheckPasswordSignInAsync(user, request.Password, false);
 
-        if (!signInResult.Succeeded)
+        if (signInResult.Succeeded)
         {
             return Unauthorized();
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser; Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsAccessToken_WhenAuthenticated; Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsUnauthorized_WhenPasswordCheckFails

[Killed] Block removal mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:62:9
         var signInResult = await _signInManager.CheckPasswordSignInAsync(user, request.Password, false);
 
         if (!signInResult.Succeeded)
-        {
-            return Unauthorized();
-        }
+        {}
 
         var accessToken = _accessTokenGenerator.Create(user);
killedBy: Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsUnauthorized_WhenPasswordCheckFails

[Killed] Object initializer mutation
recipes-api-base-build/Recipes.Api/Controllers/AuthController.cs:68:22
 
         var accessToken = _accessTokenGenerator.Create(user);
 
-        var result = new LoginResult
-        {
-            AccessToken = accessToken
-        };
+        var result = new LoginResult
+{};
 
         return Ok(result);
killedBy: Recipes.Test.Unit.Api.Controllers.AuthControllerTests.Index_ReturnsAccessToken_WhenAuthenticated
