[Survived] String mutation
recipes-api-base-build/Recipes.Api/Controllers/WeatherForecastController.cs:12:21
 public class WeatherForecastController : ControllerBase
 {
     private static readonly string[] Summaries = {
-        "Freezing", "Bracing", "Chilly", "Cool", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
+        "Freezing", "", "Chilly", "Cool", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
     };
     

[Survived] String mutation
recipes-api-base-build/Recipes.Api/Controllers/WeatherForecastController.cs:12:66
 public class WeatherForecastController : ControllerBase
 {
     private static readonly string[] Summaries = {
-        "Freezing", "Bracing", "Chilly", "Cool", "Mild", "Warm", "Balmy", "Hot", "Sweltering", "Scorching"
+        "Freezing", "Bracing", "Chilly", "Cool", "Mild", "Warm", "", "Hot", "Sweltering", "Scorching"
     };
     

[NoCoverage] Object initializer mutation
recipes-api-base-build/Recipes.Api/Controllers/WeatherForecastController.cs:20:63
     [ProducesResponseType(401)]
     public IActionResult Get()
     {
-        var forecast = Enumerable.Range(1, 5).Select(index => new WeatherForecast
-            {
-                Date = DateTime.Now.AddDays(index),
-                TemperatureC = Random.Shared.Next(-20, 55),
-                Summary = Summaries[Random.Shared.Next(Summaries.Length)]
-            })
+        var forecast = Enumerable.Range(1, 5).Select(index => new WeatherForecast
+{})
             .ToArray();
 

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
recipes-api-base-build/Recipes.Api/Controllers/WeatherForecastController.cs:23:51
         var forecast = Enumerable.Range(1, 5).Select(index => new WeatherForecast
             {
                 Date = DateTime.Now.AddDays(index),
-                TemperatureC = Random.Shared.Next(-20, 55),
+                TemperatureC = Random.Shared.Next(+20, 55),
                 Summary = Summaries[Random.Shared.Next(Summaries.Length)]
             })
