[Killed] Block removal mutation
recipes-api-base-build/Recipes.Api/Options/JwtConfigOptions.cs:12:5
     private readonly IOptionsMonitor<JwtSettings> _settingsMonitor;
 
     public JwtConfigOptions(IOptionsMonitor<JwtSettings> settingsMonitor)
-    {
-        _settingsMonitor = settingsMonitor;
-    }
+    {}
     
     public void Configure(JwtBearerOptions options)
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Api/Options/JwtConfigOptions.cs:18:9
     
     public void Configure(JwtBearerOptions options)
     {
-        Configure(JwtBearerDefaults.AuthenticationScheme, options);
+        ;
     }
     

[Survived] Block removal mutation
recipes-api-base-build/Recipes.Api/Options/JwtConfigOptions.cs:22:5
     }
     
     public void Configure(string? name, JwtBearerOptions options)
-    {
-        var settings = _settingsMonitor.CurrentValue;
-
-        options.TokenValidationParameters.IssuerSigningKey = settings.GetSigningKey();
-        options.TokenValidationParameters.ValidIssuer = settings.Issuer;
-        options.TokenValidationParameters.ValidAudience = settings.Audience;
-    }
+    {}
 }
