[NoCoverage] String mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:29:27
                 });
         }
         
-        var xmlFilename = $"{Assembly.GetExecutingAssembly().GetName().Name}.xml";
+        var xmlFilename = $"";
         options.IncludeXmlComments(Path.Combine(AppContext.BaseDirectory, xmlFilename));
         

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:30:9
         }
         
         var xmlFilename = $"{Assembly.GetExecutingAssembly().GetName().Name}.xml";
-        options.IncludeXmlComments(Path.Combine(AppContext.BaseDirectory, xmlFilename));
+        ;
         
         var jwtSecurityScheme = new OpenApiSecurityScheme

[NoCoverage] Object initializer mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:32:33
         var xmlFilename = $"{Assembly.GetExecutingAssembly().GetName().Name}.xml";
         options.IncludeXmlComments(Path.Combine(AppContext.BaseDirectory, xmlFilename));
         
-        var jwtSecurityScheme = new OpenApiSecurityScheme
-        {
-            BearerFormat = "JWT",
-            Name = "JWT Authentication",
-            In = ParameterLocation.Header,
-            Type = SecuritySchemeType.Http,
-            Scheme = JwtBearerDefaults.AuthenticationScheme,
-            Reference = new OpenApiReference
-            {
-                Id = JwtBearerDefaults.AuthenticationScheme,
-                Type = ReferenceType.SecurityScheme
-            },
-        };
+        var jwtSecurityScheme = new OpenApiSecurityScheme
+{};
 
         options.AddSecurityDefinition(jwtSecurityScheme.Reference.Id, jwtSecurityScheme);

[NoCoverage] String mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:35:20
         var jwtSecurityScheme = new OpenApiSecurityScheme
         {
             BearerFormat = "JWT",
-            Name = "JWT Authentication",
+            Name = "",
             In = ParameterLocation.Header,
             Type = SecuritySchemeType.Http,

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:46:9
             },
         };
 
-        options.AddSecurityDefinition(jwtSecurityScheme.Reference.Id, jwtSecurityScheme);
+        ;
 
         options.AddSecurityRequirement(new OpenApiSecurityRequirement

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:48:9
 
         options.AddSecurityDefinition(jwtSecurityScheme.Reference.Id, jwtSecurityScheme);
 
-        options.AddSecurityRequirement(new OpenApiSecurityRequirement
-        {
-            { jwtSecurityScheme, Array.Empty<string>() }
-        });
+        ;
     }
 }

[NoCoverage] Collection initializer mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerConfigOptions.cs:48:40
 
         options.AddSecurityDefinition(jwtSecurityScheme.Reference.Id, jwtSecurityScheme);
 
-        options.AddSecurityRequirement(new OpenApiSecurityRequirement
-        {
-            { jwtSecurityScheme, Array.Empty<string>() }
-        });
+        options.AddSecurityRequirement(new OpenApiSecurityRequirement
+{});
     }
 }
