[NoCoverage] Block removal mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerUiConfigOptions.cs:12:5
     private readonly IApiDescriptionGroupCollectionProvider _apiDescriptionGroupCollectionProvider;
 
     public SwaggerUiConfigOptions(IApiDescriptionGroupCollectionProvider apiDescriptionGroupCollectionProvider)
-    {
-        _apiDescriptionGroupCollectionProvider = apiDescriptionGroupCollectionProvider;
-    }
+    {}
     
     public void Configure(SwaggerUIOptions options)

[NoCoverage] String mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerUiConfigOptions.cs:21:23
         // build a swagger endpoint for each discovered API version
         foreach (var description in _apiDescriptionGroupCollectionProvider.ApiDescriptionGroups.Items)
         {
-            var url = $"/swagger/{description.GroupName}/swagger.json";
+            var url = $"";
             var name = description.GroupName!.ToUpperInvariant();
             options.SwaggerEndpoint(url, name);

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Api/Options/SwaggerUiConfigOptions.cs:23:13
         {
             var url = $"/swagger/{description.GroupName}/swagger.json";
             var name = description.GroupName!.ToUpperInvariant();
-            options.SwaggerEndpoint(url, name);
+            ;
         }
     }
