[Killed] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:8:1
 
 var builder = WebApplication.CreateBuilder(args);
 
-builder.Services.AddInfrastructure(builder.Configuration);
+;
 builder.Services.AddApplication(builder.Configuration);
 
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:9:1
 var builder = WebApplication.CreateBuilder(args);
 
 builder.Services.AddInfrastructure(builder.Configuration);
-builder.Services.AddApplication(builder.Configuration);
+;
 
 builder.Services
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Survived] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:11:1
 builder.Services.AddInfrastructure(builder.Configuration);
 builder.Services.AddApplication(builder.Configuration);
 
-builder.Services
-    .AddAuthentication(JwtBearerDefaults.AuthenticationScheme)
-    .AddJwtBearer()
-    .Services
-    .ConfigureOptions<JwtConfigOptions>();
+;
 
 builder.Services.AddControllers();

[Survived] Boolean mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:19:67
 
 builder.Services.AddControllers();
 
-builder.Services.Configure<RouteOptions>(o => { o.LowercaseUrls = true; });
+builder.Services.Configure<RouteOptions>(o => { o.LowercaseUrls = false; });
 
 builder.Services.AddSwaggerGen()

[Survived] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:19:1
 
 builder.Services.AddControllers();
 
-builder.Services.Configure<RouteOptions>(o => { o.LowercaseUrls = true; });
+;
 
 builder.Services.AddSwaggerGen()

[Survived] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:21:1
 
 builder.Services.Configure<RouteOptions>(o => { o.LowercaseUrls = true; });
 
-builder.Services.AddSwaggerGen()
-    .ConfigureOptions<SwaggerConfigOptions>()
-    .ConfigureOptions<SwaggerUiConfigOptions>();
+;
 
 builder.Services.AddApiVersioning(opt =>

[Survived] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:25:1
     .ConfigureOptions<SwaggerConfigOptions>()
     .ConfigureOptions<SwaggerUiConfigOptions>();
 
-builder.Services.AddApiVersioning(opt =>
-{
-    opt.AssumeDefaultVersionWhenUnspecified = true;
-    opt.ReportApiVersions = true;
-}).AddApiExplorer(options =>
-{
-    // ReSharper disable once StringLiteralTypo
-    options.GroupNameFormat = "'v'VVV";
-});
+;
 
 var app = builder.Build();

[Survived] Boolean mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:27:47
 
 builder.Services.AddApiVersioning(opt =>
 {
-    opt.AssumeDefaultVersionWhenUnspecified = true;
+    opt.AssumeDefaultVersionWhenUnspecified = false;
     opt.ReportApiVersions = true;
 }).AddApiExplorer(options =>

[Survived] Boolean mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:28:29
 builder.Services.AddApiVersioning(opt =>
 {
     opt.AssumeDefaultVersionWhenUnspecified = true;
-    opt.ReportApiVersions = true;
+    opt.ReportApiVersions = false;
 }).AddApiExplorer(options =>
 {

[Killed] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:37:1
 
 var app = builder.Build();
 
-await app.SeedUsers();
+;
 
 if (app.Environment.IsDevelopment())
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] Statement mutation
Projects/recipes-api-base-build/Recipes.Api/Program.cs:50:1
 app.UseAuthentication();
 app.UseAuthorization();
 
-app.MapControllers().RequireAuthorization();
+;
 
 app.Run();
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser
