[NoCoverage] Arithmetic mutation
Projects/recipes-api-base-build/Recipes.Api/WeatherForecast.cs:9:32
 
     public int TemperatureC { get; set; }
 
-    public int TemperatureF => 32 + (int)(TemperatureC / 0.5556);
+    public int TemperatureF => 32 - (int)(TemperatureC / 0.5556);
 
     public string? Summary { get; set; }

[NoCoverage] Arithmetic mutation
Projects/recipes-api-base-build/Recipes.Api/WeatherForecast.cs:9:43
 
     public int TemperatureC { get; set; }
 
-    public int TemperatureF => 32 + (int)(TemperatureC / 0.5556);
+    public int TemperatureF => 32 + (int)(TemperatureC * 0.5556);
 
     public string? Summary { get; set; }
