[Killed] Block removal mutation
Recipes.Core/Application/Auth/JwtGenerator.cs:15:5
     private readonly IDateTimeProvider _dateTimeProvider;
 
     public JwtGenerator(IOptionsMonitor<JwtSettings> jwtOptions, IDateTimeProvider dateTimeProvider)
-    {
-        _jwtOptions = jwtOptions;
-        _dateTimeProvider = dateTimeProvider;
-    }
+    {}
     
     public string Create(ApplicationUser applicationUser)
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser; Recipes.Test.Unit.Core.Application.JwtGeneratorTests.Create_SetsCorrectProperties

[Killed] Object initializer mutation
Recipes.Core/Application/Auth/JwtGenerator.cs:28:31
         
         var tokenHandler = new JwtSecurityTokenHandler();
         
-        var tokenDescriptor = new SecurityTokenDescriptor
-        {
-            Audience = jwtSettings.Audience,
-            Issuer = jwtSettings.Issuer,
-            IssuedAt = utcNow,
-            Expires = utcNow.Add(jwtSettings.ExpiresIn),
-            Subject = new ClaimsIdentity(new[]
-            {
-                new Claim(ClaimTypes.Name, applicationUser.Id),
-            }),
-            SigningCredentials = new SigningCredentials(jwtSettings.GetSigningKey(), SecurityAlgorithms.HmacSha256Signature)
-        };
+        var tokenDescriptor = new SecurityTokenDescriptor
+{};
 
         return tokenHandler.CreateEncodedJwt(tokenDescriptor);
killedBy: Recipes.Test.Unit.Core.Application.JwtGeneratorTests.Create_SetsCorrectProperties
