[NoCoverage] Block removal mutation
recipes-api-base-build/Recipes.Core/Application/CachedIngredientsService.cs:11:5
     private readonly IMemoryCache _memoryCache;
 
     public CachedIngredientsService(IIngredientsApi api, IMemoryCache memoryCache)
-    {
-        _api = api;
-        _memoryCache = memoryCache;
-    }
+    {}
 }
