[Killed] Equality mutation
recipes-api-base-build/Recipes.Core/Application/HostExtensions.cs:23:17
         {
             var user = await aspNetUserManager.FindByNameAsync(defaultUser.Username);
 
-            if (user != null)
+            if (user == null)
             {
                 continue;
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
recipes-api-base-build/Recipes.Core/Application/HostExtensions.cs:32:17
 
             var result = await aspNetUserManager.CreateAsync(user, defaultUser.Password);
             
-            if (!result.Succeeded)
+            if (result.Succeeded)
             {
                 throw new Exception("Seed users failed");
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Core/Application/HostExtensions.cs:34:17
             
             if (!result.Succeeded)
             {
-                throw new Exception("Seed users failed");
+                ;
             }
         }

[NoCoverage] String mutation
recipes-api-base-build/Recipes.Core/Application/HostExtensions.cs:34:37
             
             if (!result.Succeeded)
             {
-                throw new Exception("Seed users failed");
+                throw new Exception("");
             }
         }
