[Killed] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:12:9
 {
     public static IServiceCollection AddApplication(this IServiceCollection serviceCollection, IConfiguration configuration)
     {
-        serviceCollection.Configure<UserSettings>(configuration.GetRequiredSection("User"));
+        ;
         serviceCollection.Configure<JwtSettings>(configuration.GetRequiredSection("Jwt"));
         
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:12:84
 {
     public static IServiceCollection AddApplication(this IServiceCollection serviceCollection, IConfiguration configuration)
     {
-        serviceCollection.Configure<UserSettings>(configuration.GetRequiredSection("User"));
+        serviceCollection.Configure<UserSettings>(configuration.GetRequiredSection(""));
         serviceCollection.Configure<JwtSettings>(configuration.GetRequiredSection("Jwt"));
         
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:13:9
     public static IServiceCollection AddApplication(this IServiceCollection serviceCollection, IConfiguration configuration)
     {
         serviceCollection.Configure<UserSettings>(configuration.GetRequiredSection("User"));
-        serviceCollection.Configure<JwtSettings>(configuration.GetRequiredSection("Jwt"));
+        ;
         
         serviceCollection.AddSingleton<IAccessTokenGenerator, JwtGenerator>();
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:15:9
         serviceCollection.Configure<UserSettings>(configuration.GetRequiredSection("User"));
         serviceCollection.Configure<JwtSettings>(configuration.GetRequiredSection("Jwt"));
         
-        serviceCollection.AddSingleton<IAccessTokenGenerator, JwtGenerator>();
+        ;
         
         serviceCollection.AddSingleton<IIngredientsService, CachedIngredientsService>();
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:17:9
         
         serviceCollection.AddSingleton<IAccessTokenGenerator, JwtGenerator>();
         
-        serviceCollection.AddSingleton<IIngredientsService, CachedIngredientsService>();
+        ;
 
         var assemblies = AppDomain.CurrentDomain

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:24:9
             .Where(x => x.FullName!.StartsWith(nameof(Recipes)))
             .ToArray();
         
-        serviceCollection.AddMediatR(c => c.RegisterServicesFromAssemblies(assemblies));
+        ;
         serviceCollection.AddAutoMapper(assemblies);
         serviceCollection.AddValidatorsFromAssemblies(assemblies);

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:25:9
             .ToArray();
         
         serviceCollection.AddMediatR(c => c.RegisterServicesFromAssemblies(assemblies));
-        serviceCollection.AddAutoMapper(assemblies);
+        ;
         serviceCollection.AddValidatorsFromAssemblies(assemblies);
         

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Application/ServiceCollectionExtensions.cs:26:9
         
         serviceCollection.AddMediatR(c => c.RegisterServicesFromAssemblies(assemblies));
         serviceCollection.AddAutoMapper(assemblies);
-        serviceCollection.AddValidatorsFromAssemblies(assemblies);
+        ;
         
         return serviceCollection;
