[Survived] Statement mutation
Infrastructure/Database/EntityConfigurations/IngredientEntityConfiguration.cs:11:9
 {
     public void Configure(EntityTypeBuilder<Ingredient> builder)
     {
-        builder.HasKey(i => i.Id);
+        ;
     }
 }
