[Survived] Statement mutation
Infrastructure/Database/EntityConfigurations/RecipeEntityConfiguration.cs:11:9
 {
     public void Configure(EntityTypeBuilder<Recipe> builder)
     {
-        builder.HasKey(r => r.Id);
+        ;
 
         builder.Property(r => r.Name).IsRequired();

[Survived] Statement mutation
Infrastructure/Database/EntityConfigurations/RecipeEntityConfiguration.cs:13:9
     {
         builder.HasKey(r => r.Id);
 
-        builder.Property(r => r.Name).IsRequired();
+        ;
 
         builder.HasMany(r => r.Ingredients).WithOne(i => i.Recipe);

[Survived] Statement mutation
Infrastructure/Database/EntityConfigurations/RecipeEntityConfiguration.cs:15:9
 
         builder.Property(r => r.Name).IsRequired();
 
-        builder.HasMany(r => r.Ingredients).WithOne(i => i.Recipe);
+        ;
     }
 }
