[Survived] Statement mutation
Infrastructure/Database/EntityConfigurations/UserEntityConfiguration.cs:11:9
 {
     public void Configure(EntityTypeBuilder<ApplicationUser> builder)
     {
-        builder.HasMany(u => u.Recipes).WithOne(r => r.ApplicationUser);
+        ;
     }
 }
