[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:201:41
                     table.ForeignKey(
                         name: "FK_Ingredients_Recipes_RecipeId",
                         column: x => x.RecipeId,
-                        principalTable: "Recipes",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:209:25
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetRoleClaims_RoleId",
                 table: "AspNetRoleClaims",
-                column: "RoleId");
+                column: "");
 
             migrationBuilder.CreateIndex(
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:224:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetUserLogins_UserId",
-                table: "AspNetUserLogins",
+                table: "",
                 column: "UserId");
 
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:234:24
 
             migrationBuilder.CreateIndex(
                 name: "EmailIndex",
-                table: "AspNetUsers",
+                table: "",
                 column: "NormalizedEmail");
 
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:238:23
                 column: "NormalizedEmail");
 
             migrationBuilder.CreateIndex(
-                name: "UserNameIndex",
+                name: "",
                 table: "AspNetUsers",
                 column: "NormalizedUserName",
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:239:24
 
             migrationBuilder.CreateIndex(
                 name: "UserNameIndex",
-                table: "AspNetUsers",
+                table: "",
                 column: "NormalizedUserName",
                 unique: true);
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Survived] Statement mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:243:13
                 column: "NormalizedUserName",
                 unique: true);
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Ingredients_RecipeId",
-                table: "Ingredients",
-                column: "RecipeId");
+            ;
 
             migrationBuilder.CreateIndex(

[Survived] Statement mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:248:13
                 table: "Ingredients",
                 column: "RecipeId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_Recipes_ApplicationUserId",
-                table: "Recipes",
-                column: "ApplicationUserId");
+            ;
         }
 

[Killed] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:251:25
             migrationBuilder.CreateIndex(
                 name: "IX_Recipes_ApplicationUserId",
                 table: "Recipes",
-                column: "ApplicationUserId");
+                column: "");
         }
 
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[NoCoverage] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:260:23
                 name: "AspNetRoleClaims");
 
             migrationBuilder.DropTable(
-                name: "AspNetUserClaims");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:271:13
             migrationBuilder.DropTable(
                 name: "AspNetUserTokens");
 
-            migrationBuilder.DropTable(
-                name: "Ingredients");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:272:23
                 name: "AspNetUserTokens");
 
             migrationBuilder.DropTable(
-                name: "Ingredients");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:277:13
             migrationBuilder.DropTable(
                 name: "AspNetRoles");
 
-            migrationBuilder.DropTable(
-                name: "Recipes");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
Infrastructure/Database/Migrations/20240221110140_Initial.cs:278:23
                 name: "AspNetRoles");
 
             migrationBuilder.DropTable(
-                name: "Recipes");
+                name: "");
 
             migrationBuilder.DropTable(
