[Killed] Statement mutation
Recipes.Core/Infrastructure/Database/RecipesDbContext.cs:20:9
 
     protected override void OnModelCreating(ModelBuilder modelBuilder)
     {
-        base.OnModelCreating(modelBuilder);
+        ;
         
         modelBuilder.ApplyConfigurationsFromAssembly(GetType().Assembly);
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Survived] Statement mutation
Recipes.Core/Infrastructure/Database/RecipesDbContext.cs:22:9
     {
         base.OnModelCreating(modelBuilder);
         
-        modelBuilder.ApplyConfigurationsFromAssembly(GetType().Assembly);
+        ;
     }
 }
