[NoCoverage] Block removal mutation
Recipes.Core/Infrastructure/Ingredients/IngredientsApi.cs:12:5
     private readonly HttpClient _httpClient;
 
     public IngredientsApi(IOptions<IngredientsApiSettings> options, HttpClient httpClient)
-    {
-        _options = options;
-        _httpClient = httpClient;
-    }
+    {}
 }
