[Killed] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:19:9
     public static IServiceCollection AddInfrastructure(this IServiceCollection serviceCollection,
         IConfiguration configuration)
     {
-        serviceCollection.AddSingleton<IDateTimeProvider, SystemDateTimeProvider>();
+        ;
         
         serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("IngredientsApi"));
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:21:9
     {
         serviceCollection.AddSingleton<IDateTimeProvider, SystemDateTimeProvider>();
         
-        serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("IngredientsApi"));
+        ;
         serviceCollection.AddHttpClient<IIngredientsApi, IngredientsApi>();
 

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:22:9
         serviceCollection.AddSingleton<IDateTimeProvider, SystemDateTimeProvider>();
         
         serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("IngredientsApi"));
-        serviceCollection.AddHttpClient<IIngredientsApi, IngredientsApi>();
+        ;
 
         serviceCollection.AddMemoryCache();

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:24:9
         serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("IngredientsApi"));
         serviceCollection.AddHttpClient<IIngredientsApi, IngredientsApi>();
 
-        serviceCollection.AddMemoryCache();
+        ;
 
         serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("RecipesDb"));

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:26:9
 
         serviceCollection.AddMemoryCache();
 
-        serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("RecipesDb"));
+        ;
         serviceCollection.AddDbContext<RecipesDbContext>((sp, b) =>
         {

[Survived] String mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:26:89
 
         serviceCollection.AddMemoryCache();
 
-        serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("RecipesDb"));
+        serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection(""));
         serviceCollection.AddDbContext<RecipesDbContext>((sp, b) =>
         {

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:27:9
         serviceCollection.AddMemoryCache();
 
         serviceCollection.Configure<RecipesDbSettings>(configuration.GetRequiredSection("RecipesDb"));
-        serviceCollection.AddDbContext<RecipesDbContext>((sp, b) =>
-        {
-            var hostEnvironment = sp.GetRequiredService<IHostEnvironment>();
-            var dbOptions = sp.GetRequiredService<IOptions<RecipesDbSettings>>();
-
-            var dbPath = Path.Join(hostEnvironment.ContentRootPath, dbOptions.Value.DatabaseName);
-
-            b.UseSqlite($"Data Source={dbPath}");
-        });
+        ;
 
         serviceCollection.AddScoped<IRecipesDbContext>(sp => sp.GetRequiredService<RecipesDbContext>());

[NoCoverage] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:34:13
 
             var dbPath = Path.Join(hostEnvironment.ContentRootPath, dbOptions.Value.DatabaseName);
 
-            b.UseSqlite($"Data Source={dbPath}");
+            ;
         });
 

[NoCoverage] String mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:34:25
 
             var dbPath = Path.Join(hostEnvironment.ContentRootPath, dbOptions.Value.DatabaseName);
 
-            b.UseSqlite($"Data Source={dbPath}");
+            b.UseSqlite($"");
         });
 

[Survived] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:37:9
             b.UseSqlite($"Data Source={dbPath}");
         });
 
-        serviceCollection.AddScoped<IRecipesDbContext>(sp => sp.GetRequiredService<RecipesDbContext>());
+        ;
 
         serviceCollection.AddIdentityCore<ApplicationUser>()

[Killed] Statement mutation
recipes-api-base-build/Recipes.Core/Infrastructure/ServiceCollectionExtensions.cs:39:9
 
         serviceCollection.AddScoped<IRecipesDbContext>(sp => sp.GetRequiredService<RecipesDbContext>());
 
-        serviceCollection.AddIdentityCore<ApplicationUser>()
-            .AddUserManager<AspNetUserManager<ApplicationUser>>()
-            .AddSignInManager()
-            .AddEntityFrameworkStores<RecipesDbContext>();
+        ;
 
         return serviceCollection;
killedBy: Recipes.Test.Integration.Controllers.AuthControllerTests.Index_AuthenticatesUser
